name: "vae_decoder"
platform: "tensorrt_plan"
default_model_filename: "vae.plan"
max_batch_size : 0
input [
  {
    name: "latent"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1, -1 ]
  }
]
output [
  {
    name: "images"
    data_type: TYPE_FP16
    dims: [ -1, -1, -1, -1 ]
  }
]
